{
    "latest": "1.0.55",
    "download_url": "https://github.com/xvi82/delitos-leves/releases/download/app/Procesador.de.Delitos.Leves.zip",
    "file_size": 58875840,
    "versions": [
        {
            "version": "1.0.41",
            "fecha": "2026-01-05",
            "novedades": "Mejorada la compatibilidad y estabilidad en la versión compilada: corrección del cálculo de la fecha y de la carga de nombres/fundamentos para evitar errores y asegurar que los textos se generan correctamente."
        },
        {
            "version": "1.0.42",
            "fecha": "2026-01-08",
            "novedades": "Nueva función de recuperación de sesión: Se añade autoguardado automático cada 3 minutos en segundo plano que permite recuperar el trabajo pendiente si la aplicación se cierra de forma inesperada (crash), preguntando al usuario si desea restaurar la sesión al volver a abrir la aplicación."
        },
        {
            "version": "1.0.43",
            "fecha": "2026-01-09",
            "novedades": "Facturación automática con PDF adjunto al email de licencia. Nuevo email de contacto: procesadordelitosleves@gmail.com"
        },
        {
            "version": "1.0.44",
            "fecha": "2026-01-09",
            "novedades": "Ventana de bienvenida: Rediseño visual con icono (balanza), eslogan profesional, estructura jerárquica mejorada, texto más conciso y nota informativa destacada en paleta monocromática."
        },
        {
            "version": "1.0.45",
            "fecha": "2026-01-13",
            "novedades": "Nuevo sistema de alertas críticas que notifica al usuario de actualizaciones urgentes de seguridad o correcciones importantes"
        },
        {
            "version": "1.0.46",
            "fecha": "2026-01-13",
            "novedades": "Añadida la Biblioteca Comunitaria, una nueva función para usuarios con licencia que permite compartir argumentos jurídicos con la comunidad, explorar argumentos publicados por otros usuarios, y descargarlos para usarlos en tus sentencias."
        },
        {
            "version": "1.0.47",
            "fecha": "2026-01-13",
            "novedades": "Se ha implementado drag and drop en el Treeview de la pestaña Notas, permitiendo arrastrar argumentos entre carpetas (incluyendo Argumentos para Sentencia que actualiza automáticamente los motivos de condena/absolución), con tooltip visual durante el arrastre, posibilidad de mover a la raíz y cancelación con Escape."
        },
        {
            "version": "1.0.48",
            "fecha": "2026-01-13",
            "novedades": "Corregido fallo de actualización causado por emojis en GitHub Pages (Jekyll), añadido sistema anti-caché con timestamp, verificación automática de despliegue, validación robusta de versiones y ZIP, y aumentados los timeouts de conexión."
        },
        {
            "version": "1.0.49",
            "fecha": "2026-01-13",
            "novedades": "Mejoras y correcciones"
        },
        {
            "version": "1.0.50",
            "fecha": "2026-01-13",
            "novedades": "Mejorada la consistencia visual de la ventana de configuración: se ajustó el ancho del texto en los LabelFrames de Dictado por voz y Estadísticas de uso, se aplicó el estilo gris a los textos explicativos de la pestaña Comunidad, y se añadieron textos informativos al panel de Inteligencia Artificial que varían según esté habilitada o no."
        },
        {
            "version": "1.0.51",
            "fecha": "2026-01-13",
            "novedades": "Corregido error de conexión al comprobar actualizaciones en versión compilada"
        },
        {
            "version": "1.0.52",
            "fecha": "2026-01-13",
            "novedades": "Corregido error de conexión HTTPS al comprobar actualizaciones en versión compilada"
        },
        {
            "version": "1.0.53",
            "fecha": "2026-01-13",
            "novedades": "Corregido error de conexion HTTPS al comprobar actualizaciones"
        },
        {
            "version": "1.0.54",
            "fecha": "2026-01-13",
            "novedades": "Corregido error de conexion HTTPS al comprobar actualizaciones otra vez."
        },
        {
            "version": "1.0.55",
            "fecha": "2026-01-13",
            "novedades": "Test sin limpieza para verificar SSL"
        }
    ]
}