{
    "latest": "1.0.72",
    "download_url": "https://github.com/xvi82/delitos-leves/releases/download/app/Procesador.de.Delitos.Leves.zip",
    "file_size": 25035567,
    "versions": [
        {
            "version": "1.0.58",
            "fecha": "2026-01-13",
            "novedades": "Corregido error SSL al comprobar actualizaciones"
        },
        {
            "version": "1.0.59",
            "fecha": "2026-01-13",
            "novedades": "Se corrigio la ruta del Repositorio de argumentos para que funcione correctamente en la version compilada, anadiendo la funcion get_internal_path() que detecta automaticamente si buscar los recursos dentro de _internal (compilado) o junto al script (desarrollo)."
        },
        {
            "version": "1.0.60",
            "fecha": "2026-01-13",
            "novedades": "Corregido: al crear un nuevo argumento o carpeta teniendo seleccionada Argumentos para Sentencia o Descargados de la comunidad, ahora se crea en la raiz del repositorio en lugar de dentro de esas carpetas especiales."
        },
        {
            "version": "1.0.61",
            "fecha": "2026-01-14",
            "novedades": "Se anadio autocompletado con filtrado dinamico al teclear en los Combobox de Delito de principal26.py (pestanas Sentencia y SenorIA, para uno o dos delitos), mostrando solo coincidencias y sugiriendo la primera opcion que empieza por el texto escrito."
        },
        {
            "version": "1.0.62",
            "fecha": "2026-01-14",
            "novedades": "Se ha reforzado el prompt de SenorIA para limitarse estrictamente a la doctrina aportada (sin inferencias ni citas inventadas), se ha mejorado la logica de 1/2 delitos con validacion de doctrina y fallback seguro, y se ha anadido una notificacion toast al completarse el informe si el usuario no esta en la pestana, con mensaje narrativo y texto ajustado (mas alto y menos ancho)."
        },
        {
            "version": "1.0.63",
            "fecha": "2026-01-14",
            "novedades": "Botones de actualizacion arreglados."
        },
        {
            "version": "1.0.64",
            "fecha": "2026-01-14",
            "novedades": "Sistema de notificaciones toast unificado: Se ha implementado un nuevo sistema de toasts con tipos diferenciados (success, error, warning, info, procesando, dictado_calibrando, dictado_grabando, dictado_warning, dictado_error, autoguardado, advertencia), cada uno con su icono y titulo correspondiente (eXITO, ERROR, ADVERTENCIA, INFORMACIoN, PROCESANDO, CALIBRANDO/GRABANDO/DICTADO), eliminando los emojis hardcodeados en los mensajes y proporcionando una experiencia visual coherente en toda la aplicacion."
        },
        {
            "version": "1.0.65",
            "fecha": "2026-01-14",
            "novedades": "Se anade notificacion toast cuando la valoracion de SenorIA se completa y la aplicacion no tiene el foco, ademas de cuando el usuario esta en otra pestana."
        },
        {
            "version": "1.0.66",
            "fecha": "2026-01-14",
            "novedades": "Se ha implementado un sistema unificado de notificaciones toast con tipos diferenciados (success, error, warning, info, procesando, dictado_), animacion slide-in desde la derecha, hover para pausar el temporizador, fade-out al cerrar, duracion ajustada al tiempo real de calibracion del microfono, icono de informacion en azul, y funcionalidad de clic en el toast de informe IA exitoso que navega automaticamente a la pestana SenorIA."
        },
        {
            "version": "1.0.67",
            "fecha": "2026-01-14",
            "novedades": "Sistema de rollback para actualizaciones: Implementado sistema que permite restaurar la version anterior de la aplicacion si una actualizacion causa problemas, con backup automatico persistente en AppData, deteccion de posibles fallos post-actualizacion, limpieza automatica tras 15 dias, y nueva seccion en Configuracion  Ayuda que muestra informacion del backup disponible (version, fecha, tamano) con opcion de restaurar."
        },
        {
            "version": "1.0.68",
            "fecha": "2026-01-14",
            "novedades": "Anadido sistema de logging para depuracion que registra errores de estadisticas y autoguardado en debug_principal26.log."
        },
        {
            "version": "1.0.69",
            "fecha": "2026-01-14",
            "novedades": "Seccion de rollback separada en configuracion que muestra info del backup y solo aparece si hay backup disponible."
        },
        {
            "version": "1.0.70",
            "fecha": "2026-01-14",
            "novedades": "Mejorada la disposicion del panel de rollback en configuracion, con el boton en linea separada."
        },
        {
            "version": "1.0.71",
            "fecha": "2026-01-14",
            "novedades": "Correccion del sistema de rollback: Los archivos de control interno (rollback_info.json, startup_ok.flag, startup_count.txt) ya no se copian a la carpeta de la aplicacion al restaurar una version anterior."
        },
        {
            "version": "1.0.72",
            "fecha": "2026-01-15",
            "novedades": "Correcciones menores"
        }
    ]
}